 /*
 * Для начала нашей программы нужно объявить класс
 * public class (Имя класса на Англ языке) {} - скобки обязательны
 * Классы это своеобразные файлы для выполнения или
 * хранения кода
 * В скобках класса мы объявляем (функции - методы) у них разные названия, но суть одна
 * Исполнительный класс определяется строкой исполнения (функцией) main
 * public static void main(String[] args) {} - скобки обязательны
 * В скобках главной функции мы можем вызывать классы, а так же функции классов
 * */

public class Learn1 {
    public static void main(String[] args) {

        System.out.println("hello!");
    }
}
        /*
        * Это первый урок, который выводит Hello в командную строку
        * Что бы вывести что, то на консоль
        * Нужно написать System.out.println();
        * Обязательно ставить точку с запятой в конце (;)
        * Она означает что что данная строка закончена
        * Выполнение команд в коде выполняется построчно
        * Сверху Вниз
        * Для запуска программы нужно нажать Shift + F10
        * */


